Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
      = {
                                      - enabled             = true
                                      - failureThreshold    = 3
                                      - initialDelaySeconds = 30
                                      - periodSeconds       = 10
                                      - successThreshold    = 1
                                      - timeoutSeconds      = 1
                                    }
                                  - nodeSelector                 = {}
                                  - podAnnotations               = {}
                                  - podDisruptionBudget          = {}
                                  - podLabels                    = {}
                                  - readinessProbe               = {
                                      - enabled             = true
                                      - failureThreshold    = 3
                                      - initialDelaySeconds = 5
                                      - periodSeconds       = 10
                                      - successThreshold    = 1
                                      - timeoutSeconds      = 1
                                    }
                                  - replicas                     = 1
                                  - resources                    = {}
                                  - revisionHistoryLimit         = 10
                                  - securityContext              = {
                                      - fsGroup        = 65534
                                      - runAsGroup     = 65534
                                      - runAsNonRoot   = true
                                      - runAsUser      = 65534
                                      - seccompProfile = {
                                          - type = "RuntimeDefault"
                                        }
                                    }
                                  - service                      = {
                                      - additionalPorts          = []
                                      - annotations              = {}
                                      - clusterIP                = ""
                                      - externalIPs              = []
                                      - externalTrafficPolicy    = "Cluster"
                                      - ipDualStack              = {
                                          - enabled        = false
                                          - ipFamilies     = [
                                              - "IPv6",
                                              - "IPv4",
                                            ]
                                          - ipFamilyPolicy = "PreferDualStack"
                                        }
                                      - labels                   = {}
                                      - loadBalancerIP           = ""
                                      - loadBalancerSourceRanges = []
                                      - nodePort                 = 31080
                                      - nodePortTls              = 31443
                                      - type                     = "ClusterIP"
                                    }
                                  - serviceAccount               = {
                                      - annotations                  = {}
                                      - automountServiceAccountToken = false
                                      - create                       = true
                                      - name                         = ""
                                    }
                                  - strategy                     = {}
                                  - tls                          = {
                                      - enabled       = true
                                      - internalPort  = 10250
                                      - tlsMinVersion = "VersionTLS13"
                                    }
                                  - tolerations                  = []
                                }
                              - enabled                        = true
                              - failurePolicy                  = ""
                              - mutatingWebhookConfiguration   = {
                                  - annotations = {}
                                }
                              - namespaceSelector              = {}
                              - objectSelector                 = {}
                              - patch                          = {
                                  - affinity                = {}
                                  - annotations             = {}
                                  - enabled                 = true
                                  - image                   = {
                                      - pullPolicy = "IfNotPresent"
                                      - registry   = "registry.k8s.io"
                                      - repository = "ingress-nginx/kube-webhook-certgen"
                                      - sha        = ""
                                      - tag        = "v1.5.1"
                                    }
                                  - nodeSelector            = {}
                                  - podAnnotations          = {}
                                  - priorityClassName       = ""
                                  - resources               = {}
                                  - securityContext         = {
                                      - runAsGroup     = 2000
                                      - runAsNonRoot   = true
                                      - runAsUser      = 2000
                                      - seccompProfile = {
                                          - type = "RuntimeDefault"
                                        }
                                    }
                                  - serviceAccount          = {
                                      - annotations                  = {}
                                      - automountServiceAccountToken = true
                                      - create                       = true
                                    }
                                  - tolerations             = []
                                  - ttlSecondsAfterFinished = 60
                                }
                              - patchWebhookJob                = {
                                  - securityContext = {
                                      - allowPrivilegeEscalation = false
                                      - capabilities             = {
                                          - drop = [
                                              - "ALL",
                                            ]
                                        }
                                      - readOnlyRootFilesystem   = true
                                    }
                                }
                              - timeoutSeconds                 = 10
                              - validatingWebhookConfiguration = {
                                  - annotations = {}
                                }
                            }
                          - affinity                       = {}
                          - alertmanagerConfigNamespaces   = []
                          - alertmanagerInstanceNamespaces = []
                          - alertmanagerInstanceSelector   = ""
                          - annotations                    = {}
                          - automountServiceAccountToken   = true
                          - containerSecurityContext       = {
                              - allowPrivilegeEscalation = false
                              - capabilities             = {
                                  - drop = [
                                      - "ALL",
                                    ]
                                }
                              - readOnlyRootFilesystem   = true
                            }
                          - denyNamespaces                 = []
                          - dnsConfig                      = {}
                          - enabled                        = true
                          - env                            = {
                              - GOGC = "30"
                            }
                          - extraArgs                      = []
                          - extraVolumeMounts              = []
                          - extraVolumes                   = []
                          - fullnameOverride               = ""
                          - hostNetwork                    = false
                          - image                          = {
                              - pullPolicy = "IfNotPresent"
                              - registry   = "quay.io"
                              - repository = "prometheus-operator/prometheus-operator"
                              - sha        = ""
                              - tag        = ""
                            }
                          - kubeletEndpointSliceEnabled    = false
                          - kubeletEndpointsEnabled        = true
                          - kubeletService                 = {
                              - enabled   = true
                              - name      = ""
                              - namespace = "kube-system"
                              - selector  = ""
                            }
                          - labels                         = {}
                          - lifecycle                      = {}
                          - livenessProbe                  = {
                              - enabled             = true
                              - failureThreshold    = 3
                              - initialDelaySeconds = 0
                              - periodSeconds       = 10
                              - successThreshold    = 1
                              - timeoutSeconds      = 1
                            }
                          - namespaces                     = {}
                          - networkPolicy                  = {
                              - enabled = false
                              - flavor  = "kubernetes"
                            }
                          - nodeSelector                   = {}
                          - podAnnotations                 = {}
                          - podLabels                      = {}
                          - prometheusConfigReloader       = {
                              - enableProbe = false
                              - image       = {
                                  - registry   = "quay.io"
                                  - repository = "prometheus-operator/prometheus-config-reloader"
                                  - sha        = ""
                                  - tag        = ""
                                }
                              - resources   = {}
                            }
                          - prometheusInstanceNamespaces   = []
                          - prometheusInstanceSelector     = ""
                          - readinessProbe                 = {
                              - enabled             = true
                              - failureThreshold    = 3
                              - initialDelaySeconds = 0
                              - periodSeconds       = 10
                              - successThreshold    = 1
                              - timeoutSeconds      = 1
                            }
                          - resources                      = {}
                          - revisionHistoryLimit           = 10
                          - secretFieldSelector            = "type!=kubernetes.io/dockercfg,type!=kubernetes.io/service-account-token,type!=helm.sh/release.v1"
                          - securityContext                = {
                              - fsGroup        = 65534
                              - runAsGroup     = 65534
                              - runAsNonRoot   = true
                              - runAsUser      = 65534
                              - seccompProfile = {
                                  - type = "RuntimeDefault"
                                }
                            }
                          - service                        = {
                              - additionalPorts          = []
                              - annotations              = {}
                              - clusterIP                = ""
                              - externalIPs              = []
                              - externalTrafficPolicy    = "Cluster"
                              - ipDualStack              = {
                                  - enabled        = false
                                  - ipFamilies     = [
                                      - "IPv6",
                                      - "IPv4",
                                    ]
                                  - ipFamilyPolicy = "PreferDualStack"
                                }
                              - labels                   = {}
                              - loadBalancerIP           = ""
                              - loadBalancerSourceRanges = []
                              - nodePort                 = 30080
                              - nodePortTls              = 30443
                              - type                     = "ClusterIP"
                            }
                          - serviceAccount                 = {
                              - annotations                  = {}
                              - automountServiceAccountToken = true
                              - create                       = true
                              - name                         = ""
                            }
                          - serviceMonitor                 = {
                              - additionalLabels      = {}
                              - interval              = ""
                              - labelLimit            = 0
                              - labelNameLengthLimit  = 0
                              - labelValueLengthLimit = 0
                              - metricRelabelings     = []
                              - relabelings           = []
                              - sampleLimit           = 0
                              - scrapeTimeout         = ""
                              - selfMonitor           = true
                              - targetLimit           = 0
                            }
                          - strategy                       = {}
                          - terminationGracePeriodSeconds  = 30
                          - thanosImage                    = {
                              - registry   = "quay.io"
                              - repository = "thanos/thanos"
                              - sha        = ""
                              - tag        = "v0.37.2"
                            }
                          - thanosRulerInstanceNamespaces  = []
                          - thanosRulerInstanceSelector    = ""
                          - tls                            = {
                              - enabled       = true
                              - internalPort  = 10250
                              - tlsMinVersion = "VersionTLS13"
                            }
                          - tolerations                    = []
                          - verticalPodAutoscaler          = {
                              - controlledResources = []
                              - enabled             = false
                              - maxAllowed          = {}
                              - minAllowed          = {}
                              - updatePolicy        = {
                                  - updateMode = "Auto"
                                }
                            }
                        }
                      - thanosRuler                        = {
                          - annotations         = {}
                          - enabled             = false
                          - extraSecret         = {
                              - annotations = {}
                              - data        = {}
                            }
                          - ingress             = {
                              - annotations = {}
                              - enabled     = false
                              - hosts       = []
                              - labels      = {}
                              - paths       = []
                              - tls         = []
                            }
                          - podDisruptionBudget = {
                              - enabled        = false
                              - maxUnavailable = ""
                              - minAvailable   = 1
                            }
                          - route               = {
                              - main = {
                                  - additionalRules = []
                                  - annotations     = {}
                                  - apiVersion      = "gateway.networking.k8s.io/v1"
                                  - enabled         = false
                                  - filters         = []
                                  - hostnames       = []
                                  - kind            = "HTTPRoute"
                                  - labels          = {}
                                  - matches         = [
                                      - {
                                          - path = {
                                              - type  = "PathPrefix"
                                              - value = "/"
                                            }
                                        },
                                    ]
                                  - parentRefs      = []
                                }
                            }
                          - service             = {
                              - additionalPorts          = []
                              - annotations              = {}
                              - clusterIP                = ""
                              - externalIPs              = []
                              - externalTrafficPolicy    = "Cluster"
                              - ipDualStack              = {
                                  - enabled        = false
                                  - ipFamilies     = [
                                      - "IPv6",
                                      - "IPv4",
                                    ]
                                  - ipFamilyPolicy = "PreferDualStack"
                                }
                              - labels                   = {}
                              - loadBalancerIP           = ""
                              - loadBalancerSourceRanges = []
                              - nodePort                 = 30905
                              - port                     = 10902
                              - targetPort               = 10902
                              - type                     = "ClusterIP"
                            }
                          - serviceAccount      = {
                              - annotations = {}
                              - create      = true
                              - name        = ""
                            }
                          - serviceMonitor      = {
                              - additionalEndpoints   = []
                              - additionalLabels      = {}
                              - bearerTokenFile       = null
                              - interval              = ""
                              - labelLimit            = 0
                              - labelNameLengthLimit  = 0
                              - labelValueLengthLimit = 0
                              - metricRelabelings     = []
                              - proxyUrl              = ""
                              - relabelings           = []
                              - sampleLimit           = 0
                              - scheme                = ""
                              - selfMonitor           = true
                              - targetLimit           = 0
                              - tlsConfig             = {}
                            }
                          - thanosRulerSpec     = {
                              - additionalArgs                  = []
                              - additionalConfig                = {}
                              - additionalConfigString          = ""
                              - affinity                        = {}
                              - alertDropLabels                 = []
                              - alertmanagersConfig             = {
                                  - existingSecret = {}
                                  - secret         = {}
                                }
                              - containers                      = []
                              - evaluationInterval              = ""
                              - externalPrefix                  = null
                              - externalPrefixNilUsesHelmValues = true
                              - image                           = {
                                  - registry   = "quay.io"
                                  - repository = "thanos/thanos"
                                  - sha        = ""
                                  - tag        = "v0.37.2"
                                }
                              - initContainers                  = []
                              - labels                          = {}
                              - listenLocal                     = false
                              - logFormat                       = "logfmt"
                              - logLevel                        = "info"
                              - nodeSelector                    = {}
                              - objectStorageConfig             = {
                                  - existingSecret = {}
                                  - secret         = {}
                                }
                              - paused                          = false
                              - podAntiAffinity                 = "soft"
                              - podAntiAffinityTopologyKey      = "kubernetes.io/hostname"
                              - podMetadata                     = {}
                              - portName                        = "web"
                              - priorityClassName               = ""
                              - queryConfig                     = {
                                  - existingSecret = {}
                                  - secret         = {}
                                }
                              - queryEndpoints                  = []
                              - replicas                        = 1
                              - resources                       = {}
                              - retention                       = "24h"
                              - routePrefix                     = "/"
                              - ruleNamespaceSelector           = {}
                              - ruleSelector                    = {}
                              - ruleSelectorNilUsesHelmValues   = true
                              - securityContext                 = {
                                  - fsGroup        = 2000
                                  - runAsGroup     = 2000
                                  - runAsNonRoot   = true
                                  - runAsUser      = 1000
                                  - seccompProfile = {
                                      - type = "RuntimeDefault"
                                    }
                                }
                              - storage                         = {}
                              - tolerations                     = []
                              - topologySpreadConstraints       = []
                              - volumeMounts                    = []
                              - volumes                         = []
                              - web                             = {}
                            }
                        }
                      - windowsMonitoring                  = {
                          - enabled = false
                        }
                    }
                )
              - version        = "68.4.5"
            },
        ] -> null
      - name                       = "kube-prometheus-stack" -> null
      - namespace                  = "monitoring" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://prometheus-community.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 600 -> null
      - values                     = [
          - (sensitive value),
        ] -> null
      - verify                     = false -> null
      - version                    = "68.4.5" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.kube-prometheus-stack.kubernetes_manifest.grafana-gateway will be destroyed
  # (because kubernetes_manifest.grafana-gateway is not in configuration)
- resource "kubernetes_manifest" "grafana-gateway" {
      - manifest = {
          - apiVersion = "networking.istio.io/v1beta1"
          - kind       = "VirtualService"
          - metadata   = {
              - name      = "grafana-vs"
              - namespace = "monitoring"
            }
          - spec       = {
              - gateways = [
                  - "istio-system/istio-ingressgateway",
                ]
              - hosts    = [
                  - "grafana.goboolean.io",
                ]
              - http     = [
                  - {
                      - route = [
                          - {
                              - destination = {
                                  - host = "kube-prometheus-stack-grafana.monitoring.svc.cluster.local"
                                  - port = {
                                      - number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        } -> null
      - object   = {
          - apiVersion = "networking.istio.io/v1beta1"
          - kind       = "VirtualService"
          - metadata   = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "grafana-vs"
              - namespace                  = "monitoring"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - exportTo = null
              - gateways = [
                  - "istio-system/istio-ingressgateway",
                ]
              - hosts    = [
                  - "grafana.goboolean.io",
                ]
              - http     = [
                  - {
                      - corsPolicy       = {
                          - allowCredentials    = null
                          - allowHeaders        = null
                          - allowMethods        = null
                          - allowOrigin         = null
                          - allowOrigins        = null
                          - exposeHeaders       = null
                          - maxAge              = null
                          - unmatchedPreflights = null
                        }
                      - delegate         = {
                          - name      = null
                          - namespace = null
                        }
                      - directResponse   = {
                          - body   = {
                              - bytes  = null
                              - string = null
                            }
                          - status = null
                        }
                      - fault            = {
                          - abort = {
                              - grpcStatus = null
                              - http2Error = null
                              - httpStatus = null
                              - percentage = {
                                  - value = null
                                }
                            }
                          - delay = {
                              - exponentialDelay = null
                              - fixedDelay       = null
                              - percent          = null
                              - percentage       = {
                                  - value = null
                                }
                            }
                        }
                      - headers          = {
                          - request  = {
                              - add    = null
                              - remove = null
                              - set    = null
                            }
                          - response = {
                              - add    = null
                              - remove = null
                              - set    = null
                            }
                        }
                      - match            = null
                      - mirror           = {
                          - host   = null
                          - port   = {
                              - number = null
                            }
                          - subset = null
                        }
                      - mirrorPercent    = null
                      - mirrorPercentage = {
                          - value = null
                        }
                      - mirror_percent   = null
                      - mirrors          = null
                      - name             = null
                      - redirect         = {
                          - authority    = null
                          - derivePort   = null
                          - port         = null
                          - redirectCode = null
                          - scheme       = null
                          - uri          = null
                        }
                      - retries          = {
                          - attempts              = null
                          - perTryTimeout         = null
                          - retryOn               = null
                          - retryRemoteLocalities = null
                        }
                      - rewrite          = {
                          - authority       = null
                          - uri             = null
                          - uriRegexRewrite = {
                              - match   = null
                              - rewrite = null
                            }
                        }
                      - route            = [
                          - {
                              - destination = {
                                  - host   = "kube-prometheus-stack-grafana.monitoring.svc.cluster.local"
                                  - port   = {
                                      - number = 80
                                    }
                                  - subset = null
                                }
                              - headers     = {
                                  - request  = {
                                      - add    = null
                                      - remove = null
                                      - set    = null
                                    }
                                  - response = {
                                      - add    = null
                                      - remove = null
                                      - set    = null
                                    }
                                }
                              - weight      = null
                            },
                        ]
                      - timeout          = null
                    },
                ]
              - tcp      = null
              - tls      = null
            }
        } -> null
    }

  # module.kube-prometheus-stack.kubernetes_manifest.prometheus-gateway will be destroyed
  # (because kubernetes_manifest.prometheus-gateway is not in configuration)
- resource "kubernetes_manifest" "prometheus-gateway" {
      - manifest = {
          - apiVersion = "networking.istio.io/v1beta1"
          - kind       = "VirtualService"
          - metadata   = {
              - name      = "prometheus-vs"
              - namespace = "monitoring"
            }
          - spec       = {
              - gateways = [
                  - "istio-system/istio-ingressgateway",
                ]
              - hosts    = [
                  - "prometheus.goboolean.io",
                ]
              - http     = [
                  - {
                      - route = [
                          - {
                              - destination = {
                                  - host = "kube-prometheus-stack-prometheus.monitoring.svc.cluster.local"
                                  - port = {
                                      - number = 9090
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        } -> null
      - object   = {
          - apiVersion = "networking.istio.io/v1beta1"
          - kind       = "VirtualService"
          - metadata   = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "prometheus-vs"
              - namespace                  = "monitoring"
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - spec       = {
              - exportTo = null
              - gateways = [
                  - "istio-system/istio-ingressgateway",
                ]
              - hosts    = [
                  - "prometheus.goboolean.io",
                ]
              - http     = [
                  - {
                      - corsPolicy       = {
                          - allowCredentials    = null
                          - allowHeaders        = null
                          - allowMethods        = null
                          - allowOrigin         = null
                          - allowOrigins        = null
                          - exposeHeaders       = null
                          - maxAge              = null
                          - unmatchedPreflights = null
                        }
                      - delegate         = {
                          - name      = null
                          - namespace = null
                        }
                      - directResponse   = {
                          - body   = {
                              - bytes  = null
                              - string = null
                            }
                          - status = null
                        }
                      - fault            = {
                          - abort = {
                              - grpcStatus = null
                              - http2Error = null
                              - httpStatus = null
                              - percentage = {
                                  - value = null
                                }
                            }
                          - delay = {
                              - exponentialDelay = null
                              - fixedDelay       = null
                              - percent          = null
                              - percentage       = {
                                  - value = null
                                }
                            }
                        }
                      - headers          = {
                          - request  = {
                              - add    = null
                              - remove = null
                              - set    = null
                            }
                          - response = {
                              - add    = null
                              - remove = null
                              - set    = null
                            }
                        }
                      - match            = null
                      - mirror           = {
                          - host   = null
                          - port   = {
                              - number = null
                            }
                          - subset = null
                        }
                      - mirrorPercent    = null
                      - mirrorPercentage = {
                          - value = null
                        }
                      - mirror_percent   = null
                      - mirrors          = null
                      - name             = null
                      - redirect         = {
                          - authority    = null
                          - derivePort   = null
                          - port         = null
                          - redirectCode = null
                          - scheme       = null
                          - uri          = null
                        }
                      - retries          = {
                          - attempts              = null
                          - perTryTimeout         = null
                          - retryOn               = null
                          - retryRemoteLocalities = null
                        }
                      - rewrite          = {
                          - authority       = null
                          - uri             = null
                          - uriRegexRewrite = {
                              - match   = null
                              - rewrite = null
                            }
                        }
                      - route            = [
                          - {
                              - destination = {
                                  - host   = "kube-prometheus-stack-prometheus.monitoring.svc.cluster.local"
                                  - port   = {
                                      - number = 9090
                                    }
                                  - subset = null
                                }
                              - headers     = {
                                  - request  = {
                                      - add    = null
                                      - remove = null
                                      - set    = null
                                    }
                                  - response = {
                                      - add    = null
                                      - remove = null
                                      - set    = null
                                    }
                                }
                              - weight      = null
                            },
                        ]
                      - timeout          = null
                    },
                ]
              - tcp      = null
              - tls      = null
            }
        } -> null
    }

  # module.loki-stack.google_service_account.loki_gcs_sa will be destroyed
  # (because google_service_account.loki_gcs_sa is not in configuration)
- resource "google_service_account" "loki_gcs_sa" {
      - account_id   = "loki-gcs-sa" -> null
      - description  = "Service account for Loki to access GCS" -> null
      - disabled     = false -> null
      - display_name = "Loki GCS Service Account" -> null
      - email        = "loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - id           = "projects/goboolean-448812/serviceAccounts/loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - name         = "projects/goboolean-448812/serviceAccounts/loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - project      = "goboolean-448812" -> null
      - unique_id    = "101010563089534954929" -> null
    }

  # module.loki-stack.google_service_account_iam_binding.workload_identity_binding will be destroyed
  # (because google_service_account_iam_binding.workload_identity_binding is not in configuration)
- resource "google_service_account_iam_binding" "workload_identity_binding" {
      - etag               = "BwYt2l8UU9U=" -> null
      - id                 = "projects/goboolean-448812/serviceAccounts/loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> null
      - members            = [
          - "serviceAccount:goboolean-448812.svc.id.goog[monitoring/loki-sa]",
        ] -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/goboolean-448812/serviceAccounts/loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
    }

  # module.loki-stack.google_storage_bucket_iam_member.loki_gcs_role will be destroyed
  # (because google_storage_bucket_iam_member.loki_gcs_role is not in configuration)
- resource "google_storage_bucket_iam_member" "loki_gcs_role" {
      - bucket = "b/goboolean-loki" -> null
      - etag   = "CAI=" -> null
      - id     = "b/goboolean-loki/roles/storage.objectUser/serviceAccount:loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:loki-gcs-sa@goboolean-448812.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectUser" -> null
    }

  # module.monitoring.helm_release.prometheus will be created
+ resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "68.4.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.kubernetes_manifest.grafana-gateway will be created
+ resource "kubernetes_manifest" "grafana-gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "grafana-vs"
              + namespace = "monitoring"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "grafana.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "prometheus-grafana.monitoring.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-vs"
              + namespace                  = "monitoring"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "grafana.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "prometheus-grafana.monitoring.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.monitoring.kubernetes_manifest.prometheus-gateway will be created
+ resource "kubernetes_manifest" "prometheus-gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "prometheus-vs"
              + namespace = "monitoring"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "prometheus.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "prometheus-kube-prometheus-prometheus.monitoring.svc.cluster.local"
                                  + port = {
                                      + number = 9090
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "prometheus-vs"
              + namespace                  = "monitoring"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "prometheus.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "prometheus-kube-prometheus-prometheus.monitoring.svc.cluster.local"
                                  + port   = {
                                      + number = 9090
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

Plan: 3 to add, 2 to change, 6 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 2 to change, 6 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
